Reports/ТаблицаОтделок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ТаблицаОтделок</Name>
		</Properties>
	</Report>
</MetaDataObject>

Catalogs/ИзделияКомплект.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ИзделияКомплект</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГабаритныйЧертеж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВнешнегоСоглосования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКомпозиции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Композиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конструктор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеКомплекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаСогласование</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаУтверждение</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВерсииКанбан</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаВремени_Монтажа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаВремени_ПКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаВремени_Производства</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаВремени_РКД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеПомещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланПКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланПодряд</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИзделияЭлемент</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИзделиеЭлемент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИзделияЭлемент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Комментарии</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКомментария</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Образцы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомпонентИзделия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Образец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Образцы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеОтделки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТребуетсяОбразец</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Reports/ТаблицаОтделок/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ОбновитьНаСервере()

	ПолеВывода.Очистить();	

	Если ВыводитьКартинки Тогда
	
		
		
	
	Иначе
	
		ВывестиБезКартинок();	
	
	КонецЕсли;	
	
КонецПроцедуры 

Функция ВывестиБезКартинок()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИзделияКомплектОбразцы.Образец КАК Образец,
		|	ИзделияКомплектОбразцы.ТребуетсяОбразец КАК ТребуетсяОбразец,
		|	ИзделияКомплектОбразцы.КомпонентИзделия КАК КомпонентИзделия,
		|	ИзделияКомплектОбразцы.Комментарий КАК Комментарий,
		|	ИзделияКомплектОбразцы.Ссылка КАК Комплект,
		|	ИзделияКомплектОбразцы.Ссылка.Наименование КАК НаименованиеКомплекта,
		|	ИзделияКомплектОбразцы.Образец.Представление КАК ОбразецПредставление
		|ИЗ
		|	Справочник.ИзделияКомплект.Образцы КАК ИзделияКомплектОбразцы
		|ГДЕ
		|	ИзделияКомплектОбразцы.Ссылка.Проект = &Проект
		|	И ВЫБОР
		|			КОГДА &НеЗаполненые
		|				ТОГДА ИзделияКомплектОбразцы.ТребуетсяОбразец
		|						И ИзделияКомплектОбразцы.Образец = ЗНАЧЕНИЕ(Справочник.Образцы.ПустаяСсылка)
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	НаименованиеКомплекта,
		|	КомпонентИзделия";
	
	Запрос.УстановитьПараметр("Проект", 		Проект);
	Запрос.УстановитьПараметр("НеЗаполненые", 	НеЗаполненые);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Макет = Отчеты.ТаблицаОтделок.ПолучитьМакет("Макет");
	
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Проект = Проект;
	ПолеВывода.Вывести(Область);
	
	Область = Макет.ПолучитьОбласть("Строка");
	Пока Выборка.Следующий() Цикл
		
		Область.Параметры.Заполнить(Выборка);		
		ПолеВывода.Вывести(Область);
		
	КонецЦикла;
	
КонецФункции // ПолучитьТаблицуВывода()


&НаКлиенте
Процедура Обновить(Команда)
	
	Если ЗначениеЗаполнено(Проект) Тогда
		ОбновитьНаКлиенте();
	Иначе
		ПоказатьПредупреждение(, "Не заполнен проект.");	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНаКлиенте()

	Если ЗначениеЗаполнено(Проект) Тогда
		ОбновитьНаСервере();
	КонецЕсли;

КонецПроцедуры // Обновить()


&НаКлиенте
Процедура ПроектПриИзменении(Элемент)
	ОбновитьНаКлиенте();
КонецПроцедуры

&НаКлиенте
Процедура НеЗаполненыеПриИзменении(Элемент)
	ОбновитьНаКлиенте();
КонецПроцедуры
